Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Сообщение об ошибке — переменная строкового типа, содержащая сообщение об ошибке, если она произошла при выполнении или подготовке к выполнению программы.
en: Error message: the string variable that contains an error message if it occurred while execution or preparation to the program execution.

source: Сортировать по возрастанию / Сортировать по убыванию — сортировка позволяет упорядочить данные по выбранному полю по возрастанию либо убыванию.
en: Sort ascending / Sort descending: sorting enables to sort data by the selected field in ascending or descending order.

source: Сохранить все пакеты
en: Save all packages

source: Сохранить все — аналогично кнопке Сохранить для всех открытых Пакетов.
en: Save all is similar to Save button for all opened Packages.

source: Сохранить как — сохранение выделенного Пакета под новым именем и/или по другому доступному пути.
en: Save as enables to save the selected Package under a new name, and/or using another available path.

source: Сохранить пакет как…
en: Save package as…

source: Сохранить пакет
en: Save package

source: Сохранить — сохранение выделенного Пакета.
en: Save enables to save the selected Package.

source: Способ детализации — переключить варианты отображения детализации:
en: Detailing method: switch the detailing display options:

source: Статистика.
en: Statistics.

source: Столбцы — позволяет изменить видимость (отключить/включить отображение) определенным столбцам.
en: Columns enables to change visibility (disable/enable display) of the defined columns.

source: Столбцы — позволяет отключить/включить отображение определенным столбцам.
en: Columns: disable/enable display by the defined columns.

source: Таблица.
en: Table.

source: Транспонировать — переместить измерения из строк в столбцы и наоборот.
en: Transpose: move dimensions from rows to columns and vice versa.

source: Удалить все выражения — удаляет все имеющиеся выражения.
en: Delete all expressions enables to delete all existing expressions.

source: Удалить все... — удаляет все позиции списка;
en: Delete all... enables to delete all list item positions.

source: Удалить выражение — удаляет текущее выражение;
en: Delete expression enables to delete the current expression.

source: Удалить — удаляет выделенную позицию в списке.
en: Delete enables to delete the selected list item position.

source: Уник.значение – для дискретных полей отображает их уникальные значения.
en: Unique value displays unique values for the discrete fields.

source: Управляющие переменные (необязательный порт) — переменными можно задать значения параметров мастера настройки.
en: Control variables (optional port): it is possible to set values of the wizard parameters using variables.

source: Управляющие переменные (необязательный порт) — переменными можно задать значения параметров мастера настройки;
en: Control variables (optional port): it is possible to set values of the wizard parameters using variables.

source: Управляющие переменные — (необязательный порт) переменными можно задать значения параметров мастера настройки.
en: Control variables (optional port): it is possible to set values of the wizard parameters using variables.

source: Фильтровать факты… — открыть окно для фильтрования фактов.
en: Filter measures…: open the window to filter measures.

source: Форма.
en: Form.

source: Форматирование… — открыть окно для форматирования фактов и заголовков измерений.
en: Formatting…: open the window for formatting of measures and headers of dimensions.

source: Число не-событий – количество наблюдений в классе, для которых выходное значение – не-событие.
en: Non-events count: count of the observations in the class for which the output value is a non-event.

source: Число не-событий – количество не-событий, попавших в данный класс.
en: Non-events count: count of the non-events included into this class.

source: Число событий – количество наблюдений в классе, для которых выходное значение – событие.
en: Events count: count of the observations in the class for which the output value is an event.

source: Число событий – количество событий, попавших в данный класс.
en: Events count: count of the events included into this class.

source: EM Кластеризация
en: EM Clustering

source: REST-запрос
en: REST Request

source: SOAP-запрос
en: SOAP Request

source: Автокорреляция
en: Autocorrelation

source: Ассоциативные правила
en: Association Rules

source: Быстрый просмотр данных
en: Quick View of Data

source: Визуализаторы
en: Visualizers

source: Входной источник данных (таблица данных) — обязательный порт.
en: Input data source (data table) — required port.

source: Входной источник данных (таблица данных).
en: Input data source (data table).

source: Входной источник данных (таблица данных);
en: Input data source (data table);

source: Входной источник данных - таблица данных.
en: Input data source: data table.

source: Входные переменные (переменные), необязательный.
en: Input variables (variables), optional.

source: Выбросы — таблица, содержащая строки исходной таблицы, в которых были обнаружены выбросы.
en: Outliers: the table that contains the source table rows in which outliers have been detected.

source: Выполнение программы
en: Program Execution

source: Выходной набор данных (таблица данных).
en: Output data set (data table).

source: Выходной набор данных - исходная таблица, к которой добавлены поля со сглаженными рядами, метки таких полей снабжены постфиксами _smoothed.
en: Output data set: the source table to which the fields with smoothed series have been added. Captions of such fields include _smoothed postfixes.

source: Выходной набор данных.
en: Output data set.

source: Выходной набор — исходная таблица после обработки.
en: Output data set: the source table after processing.

source: Данные в иерархической древовидной форме;
en: Data in the hierarchic tree-like form;

source: Диапазоны для квантования (таблица данных).
en: Binning ranges (data table).

source: Добавить еще один порт.
en: Add another port.

source: Добавить ссылку на Подключение в Сценарий — в сценарий будет добавлен Узел-ссылка (1) на подключение.
en: Add reference to connection into Workflow — Reference node (1) for connection will be added to the workflow.

source: Добавить узел Подключения в Сценарий — в сценарий будет добавлен производный узел (2), унаследованный от выбранного подключения.
en: Add Connection node to Workflow — derived node (2) inherited from the selected connection will be added to the workflow.

source: Заполнение пропусков
en: Imputation

source: Значимости столбцов (таблица данных).
en: Column Significance (Data Table).

source: Извлечение XML
en: XML Extraction

source: Импорт из 1C:Предприятие 8.x
en: Import from 1C:Enterprise 8.x

source: Импорт из Excel-файла
en: Import from the Excel File

source: Импорт из LGD-файла
en: Import from the LGD File

source: Импорт из XML-файла
en: Import from the XML File

source: Импорт из базы данных
en: Import from Database

source: Импорт из текстового файла
en: Import from the Text File

source: Импортированная таблица.
en: Imported data set

source: Источник данных — таблица данных, подлежащая экспорту в базу;
en: Data source: the data table to be exported to database.

source: Источник данных — таблица данных, подлежащая экспорту.
en: Data source: the data table to be exported.

source: Источник данных — таблица данных, подлежащая экспорту;
en: Data source: the data table to be exported.

source: Калькулятор
en: Calculator

source: Квантование
en: Binning

source: Кластеризация
en: Clustering

source: Кластеризация транзакций
en: Transaction Clustering

source: Конечные классы
en: Coarse Classes

source: Координаты узлов.
en: Coordinates of nodes.

source: Корреляционный анализ
en: Correlation Analysis

source: Логистическая регрессия
en: Logistic Regression

source: Набор данных (таблица данных).
en: Data set (data table).

source: Набор данных — импортированная таблица.
en: Data set - imported data set.

source: Настроить подключение — переход к окну настройки параметров подключения.
en: Configure the connection — go to the connection configuration parameters window.

source: Нейросеть (классификация)
en: Neural Network (Classification)

source: Нейросеть (регрессия)
en: Neural Network (Regression)

source: Обучающий выходной набор (таблица данных).
en: Training output data set (data table).

source: Общий выходной набор (таблица данных).
en: Common output data set (data table).

source: Параметры классов (таблица данных).
en: Class parameters (data table).

source: Параметры подключения к источнику данных;
en: Parameters of connection to the data source;

source: Переменные;
en: Variables;

source: Подключение ClickHouse
en: ClickHouse Connection

source: Подключение Firebird
en: Firebird Connection

source: Подключение Interbase
en: Interbase Connection

source: Подключение MS Access
en: MS Access Connection

source: Подключение MS Excel
en: MS Excel Connection

source: Подключение MS SQL
en: MS SQL Connection

source: Подключение MySQL
en: MySQL Connection

source: Подключение ODBC
en: ODBC Connection

source: Подключение Oracle
en: Oracle Connection

source: Подключение PostgreSQL
en: PostgreSQL Connection

source: Подключение SOAP-сервиса
en: SOAP Service Connection

source: Подключение SQLite
en: SQLite Connection

source: Подключение к 1C:Предприятие 8.x
en: 1C:Enterprise 8.x Connection

source: Подключение к источнику XSD-схемы (обязательный порт) — подключение настроенного ранее Подключения к набору XSD-схем.
en: Connect to XSD schema source (required port) allows for connection to the Connection to set of the XSD schemas configured earlier.

source: Подключение набора XSD-схем
en: XSD Schemas Set Connection

source: Подключение — порт для установки подключения к базе данных;
en: Connection: the port for connection to database.

source: Разбиение на кластеры (таблица данных).
en: Clustering (data table).

source: Разбиение на кластеры.
en: Clustering.

source: Разбиение на множества
en: Partitioning

source: Редактирование выбросов
en: Eliminate Outliers

source: Редактировать — при нажатии позволяет редактировать параметры квантования для выбранного поля;
en: Edit: when pressing, it enables to edit the binning parameters for the selected field.

source: Самоорганизующиеся сети
en: Self-Organizing Networks

source: Сглаживание
en: Smoothing

source: Структура данных не определена.
en: Data structure is not defined.

source: Сэмплинг
en: Sampling

source: Таблица в дерево
en: Table to Tree

source: Табличные данные;
en: Table data;

source: Тестировать подключение;
en: Test connection;

source: Тестовый выходной набор (таблица данных).
en: Test output data set (data table).

source: Увеличить разрядность — каждое нажатие кнопки увеличит разрядность границ интервалов на один знак после запятой.
en: Increase decimal: each button pressing increases bitness of bin bounds by one decimal place.

source: Уменьшить разрядность — каждое нажатие кнопки уменьшит разрядность границ интервалов на один знак после запятой;
en: Decrease decimal: each button pressing decreases bitness of bin bounds by one decimal place.

source: Факторный анализ
en: Factor Analysis

source: Центры кластеров (таблица данных).
en: Cluster centers (data table).

source: Экспорт в Excel-файл
en: Export to Excel File

source: Экспорт в LGD-файл
en: Export to the LGD File

source: Экспорт в XML-файл
en: Export to the XML File

source: Экспорт в базу данных
en: , Export to Database

source: Экспорт в текстовый файл
en: Export to the Text File

source: Экстремальные значения — таблица, содержащая строки исходной таблицы, в которых были обнаружены экстремальные значения.
en: Extreme values: the table that contains the source table rows in which extreme values have been detected.

source: порту дерева.
en: tree port.

source: — Управляющие переменные (переменные), необязательный.
en: — Control variables (variables), optional.

source: — Ассоциативные правила (таблица данных).
en: — Association rules (data table).

source: — Вспомогательные данные (таблица данных).
en: — Supplementary data (data table).

source: — Входной источник данных (таблица данных).
en: — Input data source (data table).

source: — Выход нейросети (таблица данных).
en: — Neural network output (data table).

source: — Параметры кластеров.
en: — Cluster parameters.

source: — Показатели качества модели.
en: — Model quality indicators.

source: — Популярные наборы (таблица данных).
en: — Frequent sets (data table).

source: — Применение правил (таблица данных).
en: — Apply rules (data table).

source: — Разбиение на кластеры.
en: — Clustering.

source: — Управляющие переменные (переменные) — необязательный порт.
en: — Control variables (variables) — optional port.

source: — Входные переменные (переменные) — необязательный порт.
en: — Input variables (variables) — optional port.

source: — Выходной набор данных (таблица с ответами SOAP-сервиса);
en: — Output data set (table with the SOAP service responses);

source: — Дополнительные данные (таблица) содержат описание ошибок и SOAP-ответы сервиса.
en: — Additional data (table) contains description of errors and SOAP responses of the service.

source: — Дополнительный вход (таблица данных).
en: — Supplementary input (data table).

source: — Исключения (WSDL fault);
en: — Exceptions (WSDL fault);

source: — Источник данных запроса (таблица с параметрами запроса), необязательный.
en: — Request data source (table with the request parameters), optional.

source: — Источник данных запроса (таблица с параметрами запроса), необязательный;
en: — Request data source (table with the request parameters), optional;

source: — Источник данных — таблица данных, содержащая ячейки с документами XML.
en: — Data source: the data table that contains the cells with the XML documents.

source: — Исходные переменные и переменные, содержащие информацию об успешности выполнения программы:
en: — Source variables and variables that contain information on the program execution success:

source: — Набор данных — таблица данных, извлеченных из документов XML.
en: — Data set: the table of data extracted from the XML documents.

source: — Ошибки и коды завершения — таблица логов извлечения, имеет следующую структуру:
en: — Errors and exit codes — a table of extraction logs that has the following structure:

source: — Подключение к REST-сервису (связь с компонентом Подключение REST-сервиса);
en: — Connection to REST service (connection to REST Service Connection component);

source: — Подключение к SOAP-сервису (связь с компонентом Подключение SOAP-сервиса);
en: — Connection to SOAP Service (connection to SOAP Service Connection component);

source: — Поключение к источнику XSD-схемы — подключение настроенного ранее подключения к файлам XSD-схем.
en: — Connect to XSD schema source allows for connection of the configured earlier connection to the XSD schemas files.

source: — Управляющие переменные (переменные), необязательный;
en: — Control variables (variables), optional;

source: — вызов меню действий над портами переменных Сценария.
en: enables to call the action menu of ports of the Workflow variables.

source: — пересчитывает гистограмму согласно новым параметрам.
en: : recalculates the histogram according to the new parameters.

source: — порт выполняется;
en: : port is executed;

source: — порт не сконфигурирован или содержит ошибку;
en: : port is not configured or contains an error;

source: — порт сконфигурирован, но не выполняется;
en: : port has been configured but it is not executed;

source: — порт частично сконфигурирован.
en: : port has been partially configured.

source: | Синтаксис (выпадающий список)— задание синтаксиса расчета выражений калькулятора;
en: | Syntax (drop-down list) enables to set syntax of the calculator expressions calculation.

source: Пакеты
en: Packages

source: Дерево
en: Data tree

source: Дискретный
en: Discrete

source: Непрерывный
en: Continuous

source: Переменные
en: Variables

source: Подключения
en: Connections

source: Таблица
en: Table

source: ! — Логическое "НЕ".
en: ! — Logical "NOT".

source: != — Не равно;
en: != — Not equal.

source: # — номер строки в таблице;
en: #: number of row in the table;

source: # — номер строки;
en: #: number of row;

source: % — процент выполнения процесса.
en: % — percentage of the process execution.

source: %D — короткое название дня недели.
en: %D — short name of the week day.

source: %F — полное название месяца.
en: %F — full name of the month.

source: %G — часы в 24-часовом формате.
en: %G — hours in 24-hour format.

source: %H — часы в 24-часовом формате с ведущим нулем.
en: %H — hours in 24-hour format.

source: %L — дата в длинном формате.
en: %L — date in the long format.

source: %M — короткое название месяца.
en: %M — short name of the month.

source: %N — номер дня в неделе.
en: %N — day number in the week.

source: %Q — номер квартала.
en: %Q — quarter number.

source: %S — дата в коротком формате.
en: %S — date in the short format.

source: %T — время в длинном формате.
en: %T — time in the long format.

source: %W — номер недели в году.
en: %W — week number in the year.

source: %Y — год, 4 цифры.
en: %Y — year, 4 digits.

source: %d — день месяца с ведущим нулем.
en: %d — day of the month with leading zero.

source: %e — номер недели в квартале.
en: %e — week number in the quarter.

source: %g — часы в 12-часовом формате.
en: %g — hours in 12-hour format.

source: %h — часы в 12-часовом формате с ведущим нулем.
en: %h — hours in 12-hour format with leading zero.

source: %i — минуты с ведущим нулем.
en: %i — minutes with leading zero.

source: %j — день месяца.
en: %j — day of the month.

source: %l — полное название дня недели.
en: %l — full name of the week day.

source: %m — номер месяца с ведущим нулем.
en: %m — month number with leading zero.

source: %n — номер месяца.
en: %n — month number.

source: %q — номер дня в квартале.
en: %q — day number in the quarter.

source: %s — секунды с ведущим нулем.
en: %s — seconds with leading zero.

source: %t — время в коротком формате.
en: %t — time in the short format.

source: %u — миллисекунды с ведущими нулями.
en: %u — milliseconds with leading zeros.

source: %w — номер недели в месяце.
en: %w — week number in the month.

source: %y — год, 2 цифры.
en: %y — year, 2 digits.

source: %z — номер дня в году.
en: %z — day number in the year.

source: && — Логическое "И";
en: && — Logical "AND".

source: /C — выполнение указанной команды с последующим завершением;
en: /C: execution of the given command with subsequent completion;

source: /K — выполнение указанной команды без последующего завершения.
en: /K: execution of the given command without subsequent completion.

source: /Package, /Teach, /Node, /Address, /Port, /UserName, /Password, /PortName.VarName — параметры запуска в пакетном режиме.
en: /Package, /Teach, /Node, /Address, /Port, /UserName, /Password, /PortName.VarName are launch parameters in the batch mode.

source: 0 — Неопределенный Неопределенный.
en: 0 — Undefined Undefined.

source: 0 — нормально разгруппированное значение.
en: 0: the value that is normally ungrouped.

source: 0 — узел сразу завершится.
en: 0: the node will be completed at once.

source: 1 и более — количество миллисекунд, через которые узел перестанет выполняться.
en: 1 and more: number of milliseconds upon expiration of which the node will not be executed anymore.

source: 1 — Логический Логический.
en: 1 — Logical Logical.

source: 1 — разгруппированное значение, которое изначально было задано как фиксированное, но фиксация была снята алгоритмом.
en: 1: the ungrouped value that was initially set as the fixed one but fixation was removed by the algorithm.

source: 1C:Предприятие 8.x
en: 1C:Enterprise 8.x

source: 2 — Дата/время Дата/время.
en: 2 — Date/time Date/time.

source: 2 — зафиксированное пользователем значение.
en: 2: the value fixed by a user.

source: 3 — Вещественный Вещественный.
en: 3 — Real Real.

source: 3 — значение, зафиксированное пользователем, но несогласованное с опорной выборкой.
en: 3: the value fixed by a user but inconsistent with the reference sample.

source: 4 — Целый Целый.
en: 4 — Integer Integer.

source: 4 — значение, зафиксированное алгоритмом в ходе расчетов.
en: 4: the value fixed by the algorithm in the calculation process.

source: 5 — Строковый Строковый.
en: 5 — String String.

source: 5 — ошибочное значение.
en: 5: the erroneous value.

source: 6 — Переменный Переменный.
en: 6 — Variable Variable.

source: 6 — исключено из обработки.
en: 6 is excluded from processing.

source: < — Меньше;
en: < — Less than.

source: <= — Меньше или равно;
en: <= — Less than or equal to.

source: <> — Не равно;
en: <> — Not equal.

source: Переместить вверх/вниз — изменяет позицию выделенного поля в списке (поля в исходящей с порта таблице будут расположены слева направо в том же порядке, в каком они расположены в списке сверху вниз).
en: Move up/down enables to change position of the selected field in the list (the fields in the table outcoming from the port will be located from left to right in the same order in which they are located in the list from up to down).

source: Переместить вверх/вниз — изменяет позицию выделенного поля в списке (поля в исходящей с порта таблице будут расположены слева направо в том же порядке, в каком они расположены в списке сверху вниз);
en: Move up/down enables to change position of the selected field in the list (the fields in the table outcoming from the port will be located from left to right in the same order in which they are located in the list from up to down).

source: Поиск — найти значение; открыть окно настройки поиска;
en: Search — find the value; open search configuration window;

source: ID класса | Прогноз - идентификатор прогнозируемого класса.
en: Class ID | Prediction: identifier of the predicted class.

source: ID класса | Факт - идентификатор, присвоенный фактическому классу (данное поле выводится только при обучении нейросети).
en: Class ID| Fact: the identifier assigned to the actual class (this field is displayed only when neural network training).

source: Автоматическая синхронизация — при включении данного режима команда Синхронизировать поля будет выполняться автоматически при выполнении узла (включена по умолчанию).
en: Automapping: when enabling this mode, Map fields command will be automatically performed during the node execution (enabled by default).

source: Автоматическая синхронизация — при включении данного режима команда Синхронизировать поля будет выполняться автоматически при выполнении узла;
en: Automapping: when this mode is enabled, Map fields command will be automatically executed when executing the node.

source: Автоматическая синхронизация — при включении данного режима команда Синхронизировать поля будет выполняться автоматически при выполнении узла.
en: Automapping: when this mode is enabled, Map fields command will be automatically executed when executing the node.

source: Апостериорная вероятность - вычисленная по результатам обработки вероятность принадлежности текущего набора параметров прогнозируемому классу.
en: Posterior probability: the probability of the current parameters set assignment to the predicted class calculated according to the results of processing.

source: Вставить — вставка скопированного или вырезанного элемента в текущую директорию;
en: Paste: paste the copied or cut item to the current directory.

source: Входное дерево — набор данных в иерархической древовидной форме.
en: Input tree: the data set in the hierarchic tree-like form.

source: Входной источник данных — порт для подключения входного набора данных.
en: Input data source: the port for connection of the input data set.

source: Выбрать все – помечает все узлы.
en: Check all enables to check all nodes.
